# Prompt 1: Understanding SQL and Tables

Act as a SQL instructor.

Explain what SQL is and why it is used.
Create a simple example table named `employees`
with columns such as:
- employee_id
- name
- department
- salary

Explain the purpose of each column and how tables store data.

## What is SQL and why is it used?

**SQL** stands for **Structured Query Language**. It is a standardized programming language used to manage relational databases and perform various operations on the data within them.

### Why is SQL used?

SQL is incredibly powerful and widely used for several key reasons:

*   **Data Retrieval:** You can ask specific questions to your database and retrieve exactly the data you need.
*   **Data Manipulation:** It allows you to insert new data, update existing data, and delete data from your database.
*   **Data Definition:** You can create, modify, and delete database structures like tables, indexes, and views.
*   **Data Control:** It helps manage database permissions and ensure data security.
*   **Standardization:** Being a standard language, SQL queries written for one database system are often portable (with minor adjustments) to others.

---

## Example Table: `employees`

Let's create a simple `employees` table to illustrate how data is structured in a relational database. We'll use Python's built-in `sqlite3` library to simulate this, as it's a lightweight, serverless database that's great for examples.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database (this means the database only exists for the duration of the script)
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the employees table
create_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department TEXT,
    salary REAL
);
"""
cursor.execute(create_table_sql)

# Insert some example data
insert_data_sql = """
INSERT INTO employees (employee_id, name, department, salary) VALUES
(1, 'Alice Smith', 'Sales', 60000.00),
(2, 'Bob Johnson', 'Marketing', 75000.00),
(3, 'Charlie Brown', 'Engineering', 90000.00),
(4, 'Diana Prince', 'Sales', 62000.00);
"""
cursor.execute(insert_data_sql)

# Commit the changes
conn.commit()

# Verify the table creation and data insertion
print("Table 'employees' created and data inserted successfully.\n")

# Fetch and print all data from the employees table
cursor.execute("SELECT * FROM employees;")
print("Data in 'employees' table:")
for row in cursor.fetchall():
    print(row)

# Close the connection
conn.close()

Table 'employees' created and data inserted successfully.

Data in 'employees' table:
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)
(4, 'Diana Prince', 'Sales', 62000.0)

## Explaining the `employees` table and how tables store data

In a relational database, data is organized into **tables**, which are similar to spreadsheets. Each table consists of **rows** and **columns**.

*   **Rows (Records):** Each row in a table represents a single, complete entry or record. In our `employees` table, each row represents a unique employee.

*   **Columns (Fields/Attributes):** Each column defines a specific type of data that every record in the table will have. Let's look at the columns in our `employees` table:

    *   **`employee_id` (INTEGER PRIMARY KEY):**
        *   **Purpose:** This column uniquely identifies each employee. No two employees can have the same `employee_id`. It's common practice to have a unique identifier for each record in a table.
        *   **Data Type:** `INTEGER` means it stores whole numbers. `PRIMARY KEY` is a special constraint that ensures each value is unique and not null, and it's often used for quick data retrieval.

    *   **`name` (TEXT NOT NULL):**
        *   **Purpose:** Stores the full name of the employee.
        *   **Data Type:** `TEXT` means it stores character strings (like words and sentences). `NOT NULL` means this column cannot be left empty; every employee *must* have a name.

    *   **`department` (TEXT):**
        *   **Purpose:** Indicates the department where the employee works.
        *   **Data Type:** `TEXT`. Unlike `name`, this column does not have a `NOT NULL` constraint, meaning an employee's department could theoretically be unknown or left blank.

    *   **`salary` (REAL):**
        *   **Purpose:** Stores the employee's annual salary.
        *   **Data Type:** `REAL` is used for floating-point numbers (numbers with decimal places), suitable for monetary values.

### How Tables Store Data

Think of a table as a grid. Each column has a specific header (like `employee_id`, `name`, `department`, `salary`), and each row fills in data for those headers for a single entity (one employee). The database system stores this information efficiently, allowing you to quickly search, sort, and retrieve data based on the values in these columns and rows.

# Prompt 2: SELECT and WHERE Clause

Act as a SQL trainer.

Create a sample `employees` table and insert sample records.
Demonstrate how to use:
- SELECT
- WHERE

Show examples to:
- retrieve employees from a specific department
- filter employees with salary greater than a given value

Explain how the WHERE clause helps filter data in databases.

---

## Setting up the `employees` table again

To ensure we have a fresh start for demonstrating `SELECT` and `WHERE`, let's re-establish our in-memory SQLite database connection and recreate the `employees` table with some sample data.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the employees table
create_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department TEXT,
    salary REAL
);
"""
cursor.execute(create_table_sql)

# Insert some example data
insert_data_sql = """
INSERT INTO employees (employee_id, name, department, salary) VALUES
(1, 'Alice Smith', 'Sales', 60000.00),
(2, 'Bob Johnson', 'Marketing', 75000.00),
(3, 'Charlie Brown', 'Engineering', 90000.00),
(4, 'Diana Prince', 'Sales', 62000.00),
(5, 'Eve Davis', 'Sales', 68000.00),
(6, 'Frank White', 'Engineering', 95000.00);
"""
cursor.execute(insert_data_sql)

# Commit the changes
conn.commit()

print("Table 'employees' recreated and data inserted successfully.")

Table 'employees' recreated and data inserted successfully.

## Understanding `SELECT`

The `SELECT` statement is used to retrieve data from a database. It's how you specify which columns you want to see.

*   `SELECT *` means 'select all columns'.
*   `SELECT column1, column2` means 'select only column1 and column2'.

### Example: Retrieving all data from `employees`

This query fetches every column (`*`) and every row from the `employees` table.

In [ ]:
print("All employees:")
cursor.execute("SELECT * FROM employees;")
for row in cursor.fetchall():
    print(row)

All employees:
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)
(4, 'Diana Prince', 'Sales', 62000.0)
(5, 'Eve Davis', 'Sales', 68000.0)
(6, 'Frank White', 'Engineering', 95000.0)

## Understanding `WHERE`

The `WHERE` clause is used to filter records. It extracts only those records that fulfill a specified condition. Think of it as a way to ask specific questions about your data.

The basic syntax is: `SELECT columns FROM table_name WHERE condition;`

### Example: Retrieve employees from a specific department (e.g., 'Sales')

Here, we use `WHERE department = 'Sales'` to only get employees whose department column has the value 'Sales'.

In [ ]:
print("\nEmployees in the 'Sales' department:")
cursor.execute("SELECT employee_id, name, department FROM employees WHERE department = 'Sales';")
for row in cursor.fetchall():
    print(row)

Employees in the 'Sales' department:
(1, 'Alice Smith', 'Sales')
(4, 'Diana Prince', 'Sales')
(5, 'Eve Davis', 'Sales')

### Example: Filter employees with salary greater than a given value (e.g., 70000)

This query uses `WHERE salary > 70000` to find employees with a salary exceeding 70,000.

In [ ]:
print("\nEmployees with salary greater than 70000:")
cursor.execute("SELECT name, salary FROM employees WHERE salary > 70000;")
for row in cursor.fetchall():
    print(row)

Employees with salary greater than 70000:
('Bob Johnson', 75000.0)
('Charlie Brown', 90000.0)
('Frank White', 95000.0)

### How the `WHERE` clause helps filter data

In essence, the `WHERE` clause acts as a **condition filter** for your queries. Without it, a `SELECT` statement would return *all* rows from the specified table. By adding `WHERE`, you instruct the database to evaluate a condition for each row and only include those rows for which the condition evaluates to `TRUE` in the result set.

It allows you to narrow down vast amounts of data to only the relevant information you need, making your database queries precise and efficient. You can use various operators within a `WHERE` clause, such as:

*   **Comparison Operators:** `=`, `!=` (or `<>`), `>`, `<`, `>=`, `<=`
*   **Logical Operators:** `AND`, `OR`, `NOT`
*   **Special Operators:** `LIKE` (for pattern matching), `IN` (for matching any value in a list), `BETWEEN` (for values within a range), `IS NULL` / `IS NOT NULL`.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 3: ORDER BY and LIMIT

Act as a SQL expert.

Using an example table, demonstrate:
- ORDER BY
- LIMIT

Show how to:
- sort records in ascending and descending order
- retrieve only the top few records

Explain real-world use cases of sorting and limiting results.

---

## Setting up the `employees` table for `ORDER BY` and `LIMIT`

Let's ensure we have a fresh in-memory SQLite database connection and recreate our `employees` table with slightly more diverse data for better demonstration of sorting and limiting.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the employees table
create_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department TEXT,
    salary REAL
);
"""
cursor.execute(create_table_sql)

# Insert some example data with varied salaries and departments
insert_data_sql = """
INSERT INTO employees (employee_id, name, department, salary) VALUES
(1, 'Alice Smith', 'Sales', 60000.00),
(2, 'Bob Johnson', 'Marketing', 75000.00),
(3, 'Charlie Brown', 'Engineering', 90000.00),
(4, 'Diana Prince', 'Sales', 62000.00),
(5, 'Eve Davis', 'HR', 55000.00),
(6, 'Frank White', 'Engineering', 95000.00),
(7, 'Grace Lee', 'Marketing', 80000.00),
(8, 'Henry King', 'Sales', 70000.00),
(9, 'Ivy Green', 'HR', 58000.00);
"""
cursor.execute(insert_data_sql)

# Commit the changes
conn.commit()

print("Table 'employees' recreated with updated data successfully.")

print("\nAll employees (unsorted):")
cursor.execute("SELECT * FROM employees;")
for row in cursor.fetchall():
    print(row)

Table 'employees' recreated with updated data successfully.

All employees (unsorted):
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)
(4, 'Diana Prince', 'Sales', 62000.0)
(5, 'Eve Davis', 'HR', 55000.0)
(6, 'Frank White', 'Engineering', 95000.0)
(7, 'Grace Lee', 'Marketing', 80000.0)
(8, 'Henry King', 'Sales', 70000.0)
(9, 'Ivy Green', 'HR', 58000.0)

## Understanding `ORDER BY`

The `ORDER BY` clause is used to sort the result-set of a query. By default, it sorts the records in ascending order. You can explicitly specify ascending (`ASC`) or descending (`DESC`) order.

### Example: Sort records by `salary` in ascending order (lowest salary first)

In [ ]:
print("\nEmployees sorted by salary (ascending):")
cursor.execute("SELECT name, department, salary FROM employees ORDER BY salary ASC;")
for row in cursor.fetchall():
    print(row)

Employees sorted by salary (ascending):
('Eve Davis', 'HR', 55000.0)
('Ivy Green', 'HR', 58000.0)
('Alice Smith', 'Sales', 60000.0)
('Diana Prince', 'Sales', 62000.0)
('Henry King', 'Sales', 70000.0)
('Bob Johnson', 'Marketing', 75000.0)
('Grace Lee', 'Marketing', 80000.0)
('Charlie Brown', 'Engineering', 90000.0)
('Frank White', 'Engineering', 95000.0)

### Example: Sort records by `name` in descending order (Z to A)

In [ ]:
print("\nEmployees sorted by name (descending):")
cursor.execute("SELECT name, department FROM employees ORDER BY name DESC;")
for row in cursor.fetchall():
    print(row)

Employees sorted by name (descending):
('Ivy Green', 'HR')
('Henry King', 'Sales')
('Grace Lee', 'Marketing')
('Frank White', 'Engineering')
('Eve Davis', 'HR')
('Diana Prince', 'Sales')
('Charlie Brown', 'Engineering')
('Bob Johnson', 'Marketing')
('Alice Smith', 'Sales')

### Sorting by multiple columns

You can also sort by multiple columns. The sorting is applied from left to right. For example, to sort by `department` ascending, and then by `salary` descending within each department:

In [ ]:
print("\nEmployees sorted by department (ASC), then salary (DESC):")
cursor.execute("SELECT name, department, salary FROM employees ORDER BY department ASC, salary DESC;")
for row in cursor.fetchall():
    print(row)

Employees sorted by department (ASC), then salary (DESC):
('Frank White', 'Engineering', 95000.0)
('Charlie Brown', 'Engineering', 90000.0)
('Ivy Green', 'HR', 58000.0)
('Eve Davis', 'HR', 55000.0)
('Grace Lee', 'Marketing', 80000.0)
('Bob Johnson', 'Marketing', 75000.0)
('Henry King', 'Sales', 70000.0)
('Diana Prince', 'Sales', 62000.0)
('Alice Smith', 'Sales', 60000.0)

## Understanding `LIMIT`

The `LIMIT` clause is used to restrict the number of rows returned by a query. This is particularly useful when you only need a subset of the results, for example, the top N most expensive products or the 5 latest orders.

### Example: Retrieve only the top 3 records (arbitrary order)

In [ ]:
print("\nFirst 3 employees (arbitrary order due to no ORDER BY):")
cursor.execute("SELECT * FROM employees LIMIT 3;")
for row in cursor.fetchall():
    print(row)

First 3 employees (arbitrary order due to no ORDER BY):
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)

## Combining `ORDER BY` and `LIMIT`

These two clauses are often used together to retrieve specific 'top N' or 'bottom N' records. You typically `ORDER BY` first to establish the desired sort order, and then `LIMIT` the results.

### Example: Retrieve the top 2 highest-paid employees

In [ ]:
print("\nTop 2 highest-paid employees:")
cursor.execute("SELECT name, salary FROM employees ORDER BY salary DESC LIMIT 2;")
for row in cursor.fetchall():
    print(row)

Top 2 highest-paid employees:
('Frank White', 95000.0)
('Charlie Brown', 90000.0)

### Example: Retrieve the 3 employees with the lowest salaries

In [ ]:
print("\n3 employees with the lowest salaries:")
cursor.execute("SELECT name, salary FROM employees ORDER BY salary ASC LIMIT 3;")
for row in cursor.fetchall():
    print(row)

3 employees with the lowest salaries:
('Eve Davis', 55000.0)
('Ivy Green', 58000.0)
('Alice Smith', 60000.0)

## Real-world Use Cases of `ORDER BY` and `LIMIT`

These clauses are incredibly powerful for various data analysis and reporting tasks:

### `ORDER BY` use cases:
*   **Ranking:** Displaying leaderboards (e.g., top-selling products, employees with most sales).
*   **Time-series data:** Viewing the latest records first (e.g., most recent customer orders, newest blog posts).
*   **Reporting:** Organizing data in a logical sequence for easy review (e.g., customers by last name, products by price).
*   **Debugging:** Quickly finding anomalous values (e.g., sorting by error code frequency).

### `LIMIT` use cases:
*   **Pagination:** Retrieving a fixed number of results for displaying on a web page (e.g., showing 10 items per page).
*   **Sampling:** Getting a quick look at some data without fetching the entire dataset (e.g., `SELECT * FROM table LIMIT 10;`).
*   **Performance Optimization:** Reducing the amount of data transferred and processed, especially on large tables.
*   **'Top N' Analysis:** Combined with `ORDER BY`, finding the top/bottom N items (e.g., top 5 best customers, lowest 3 performing products).

Together, `ORDER BY` and `LIMIT` provide precise control over how your data is sorted and presented, making them indispensable tools for any SQL user.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 4: Aggregate Functions

Act as a SQL instructor.

Explain aggregate functions such as:
- COUNT
- SUM
- AVG

Use a simple table (such as employees or sales)
to demonstrate how these functions summarize data.

Explain why aggregation is useful in data analysis.

---

## Setting up the `employees` table for Aggregate Functions

As our previous in-memory SQLite database connection was closed, let's re-establish it and recreate the `employees` table with some sample data to demonstrate aggregate functions.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the employees table
create_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department TEXT,
    salary REAL
);
"""
cursor.execute(create_table_sql)

# Insert some example data
insert_data_sql = """
INSERT INTO employees (employee_id, name, department, salary) VALUES
(1, 'Alice Smith', 'Sales', 60000.00),
(2, 'Bob Johnson', 'Marketing', 75000.00),
(3, 'Charlie Brown', 'Engineering', 90000.00),
(4, 'Diana Prince', 'Sales', 62000.00),
(5, 'Eve Davis', 'HR', 55000.00),
(6, 'Frank White', 'Engineering', 95000.00),
(7, 'Grace Lee', 'Marketing', 80000.00),
(8, 'Henry King', 'Sales', 70000.00),
(9, 'Ivy Green', 'HR', 58000.00);
"""
cursor.execute(insert_data_sql)

# Commit the changes
conn.commit()

print("Table 'employees' recreated and data inserted successfully.")

print("\nAll employees:")
cursor.execute("SELECT * FROM employees;")
for row in cursor.fetchall():
    print(row)

Table 'employees' recreated and data inserted successfully.

All employees:
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)
(4, 'Diana Prince', 'Sales', 62000.0)
(5, 'Eve Davis', 'HR', 55000.0)
(6, 'Frank White', 'Engineering', 95000.0)
(7, 'Grace Lee', 'Marketing', 80000.0)
(8, 'Henry King', 'Sales', 70000.0)
(9, 'Ivy Green', 'HR', 58000.0)

## Understanding Aggregate Functions

Aggregate functions perform a calculation on a set of rows and return a single summary value. They are commonly used with the `SELECT` statement and often combined with the `GROUP BY` clause (which we'll explore later) to perform calculations on groups of rows.

### 1. `COUNT()`

The `COUNT()` function returns the number of rows that match a specified criterion. It can count all rows (`COUNT(*)`) or non-NULL values in a specific column (`COUNT(column_name)`).

In [ ]:
print("\nTotal number of employees:")
cursor.execute("SELECT COUNT(*) FROM employees;")
print(cursor.fetchone()[0])

print("\nNumber of employees with a department listed (COUNT(department)):")
cursor.execute("SELECT COUNT(department) FROM employees;")
print(cursor.fetchone()[0])

Total number of employees:
9

Number of employees with a department listed (COUNT(department)):
9

### 2. `SUM()`

The `SUM()` function calculates the total sum of a numeric column. It ignores NULL values.

In [ ]:
print("\nTotal of all employee salaries:")
cursor.execute("SELECT SUM(salary) FROM employees;")
print(cursor.fetchone()[0])

Total of all employee salaries:
645000.0

### 3. `AVG()`

The `AVG()` function calculates the average value of a numeric column. It also ignores NULL values.

In [ ]:
print("\nAverage employee salary:")
cursor.execute("SELECT AVG(salary) FROM employees;")
print(cursor.fetchone()[0])

Average employee salary:
71666.66666666667

## Why Aggregation is Useful in Data Analysis

Aggregate functions are fundamental to data analysis because they allow you to transform raw, detailed data into meaningful summaries. This is useful for:

*   **Getting a High-Level Overview:** Quickly understanding key metrics like the total number of items, the average price, or the sum of sales without having to look at every single record.
*   **Reporting and Dashboards:** Summarized data is perfect for generating reports, creating charts, and populating dashboards that provide insights into business performance.
*   **Identifying Trends and Anomalies:** By looking at aggregates over time or across different categories, you can spot trends (e.g., increasing average sales) or anomalies (e.g., a department with a surprisingly low total salary).
*   **Performance Measurement:** Evaluating performance metrics, such as average customer rating or total project hours.
*   **Decision Making:** Summarized data helps in making informed decisions by providing concise, actionable information rather than overwhelming detail.

In essence, aggregation helps you distill large datasets into consumable information, which is a cornerstone of effective data analysis.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 5: GROUP BY and HAVING

Act as a SQL trainer.

Explain the difference between:
- WHERE
- HAVING

Use a sample table to:
- group records using GROUP BY
- filter grouped results using HAVING

Provide simple examples and explanations.

---

## Setting up the `employees` table for `GROUP BY` and `HAVING`

Since our previous in-memory SQLite database connection was closed, let's re-establish it and recreate the `employees` table with some sample data. This will allow us to demonstrate grouping and filtering grouped results effectively.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the employees table
create_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department TEXT,
    salary REAL
);
"""
cursor.execute(create_table_sql)

# Insert some example data with varied salaries and departments
insert_data_sql = """
INSERT INTO employees (employee_id, name, department, salary) VALUES
(1, 'Alice Smith', 'Sales', 60000.00),
(2, 'Bob Johnson', 'Marketing', 75000.00),
(3, 'Charlie Brown', 'Engineering', 90000.00),
(4, 'Diana Prince', 'Sales', 62000.00),
(5, 'Eve Davis', 'HR', 55000.00),
(6, 'Frank White', 'Engineering', 95000.00),
(7, 'Grace Lee', 'Marketing', 80000.00),
(8, 'Henry King', 'Sales', 70000.00),
(9, 'Ivy Green', 'HR', 58000.00),
(10, 'Jack Miller', 'Sales', 72000.00);
"""
cursor.execute(insert_data_sql)

# Commit the changes
conn.commit()

print("Table 'employees' recreated with updated data successfully.")

print("\nAll employees:")
cursor.execute("SELECT * FROM employees;")
for row in cursor.fetchall():
    print(row)

Table 'employees' recreated with updated data successfully.

All employees:
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)
(4, 'Diana Prince', 'Sales', 62000.0)
(5, 'Eve Davis', 'HR', 55000.0)
(6, 'Frank White', 'Engineering', 95000.0)
(7, 'Grace Lee', 'Marketing', 80000.0)
(8, 'Henry King', 'Sales', 70000.0)
(9, 'Ivy Green', 'HR', 58000.0)
(10, 'Jack Miller', 'Sales', 72000.0)

## Understanding `GROUP BY`

The `GROUP BY` clause groups rows that have the same values in specified columns into summary rows. This is most often used with aggregate functions (`COUNT`, `SUM`, `AVG`, `MIN`, `MAX`) to perform calculations on each group, rather than on the entire table.

### Example: Grouping records to find the average salary per department

Here, `GROUP BY department` tells the database to group all employees belonging to the same department, and then `AVG(salary)` calculates the average salary for each of those groups.

In [ ]:
print("\nAverage salary per department:")
cursor.execute("SELECT department, AVG(salary) FROM employees GROUP BY department;")
for row in cursor.fetchall():
    print(row)

Average salary per department:
('Engineering', 92500.0)
('HR', 56500.0)
('Marketing', 77500.0)
('Sales', 66000.0)

### Example: Counting employees in each department

This query groups by `department` and then uses `COUNT(*)` to find out how many employees are in each department.

In [ ]:
print("\nNumber of employees per department:")
cursor.execute("SELECT department, COUNT(*) FROM employees GROUP BY department;")
for row in cursor.fetchall():
    print(row)

Number of employees per department:
('Engineering', 2)
('HR', 2)
('Marketing', 2)
('Sales', 4)

## Understanding `HAVING`

The `HAVING` clause is used to filter records that result from a `GROUP BY` clause. While `WHERE` filters individual rows *before* grouping, `HAVING` filters *groups* of rows *after* grouping and aggregation have occurred. You *must* use `HAVING` with aggregate functions; `WHERE` cannot filter on the results of aggregate functions.

### Example: Filter grouped results using `HAVING`

Let's find departments where the average salary is greater than $70,000.

In [ ]:
print("\nDepartments with average salary greater than 70000:")
cursor.execute("SELECT department, AVG(salary) FROM employees GROUP BY department HAVING AVG(salary) > 70000;")
for row in cursor.fetchall():
    print(row)

Departments with average salary greater than 70000:
('Engineering', 92500.0)
('Marketing', 77500.0)

### Example: Departments with more than 2 employees

Here, we use `HAVING COUNT(*) > 2` to only show departments that have more than two employees.

In [ ]:
print("\nDepartments with more than 2 employees:")
cursor.execute("SELECT department, COUNT(*) FROM employees GROUP BY department HAVING COUNT(*) > 2;")
for row in cursor.fetchall():
    print(row)

Departments with more than 2 employees:
('Sales', 4)

## The Difference Between `WHERE` and `HAVING`

The distinction between `WHERE` and `HAVING` is a common point of confusion for new SQL learners. Here's a breakdown:

| Feature           | `WHERE` Clause                                   | `HAVING` Clause                                     |
| :---------------- | :----------------------------------------------- | :-------------------------------------------------- |
| **Purpose**       | Filters individual rows                          | Filters groups of rows                              |
| **Execution Time**| Applied *before* `GROUP BY`                      | Applied *after* `GROUP BY` and aggregation          |
| **Data Scope**    | Works on original, individual column values      | Works on aggregate values (results of `COUNT`, `SUM`, `AVG`, etc.) |
| **Usage with Aggregates** | Cannot contain aggregate functions               | *Must* be used with aggregate functions (or columns from `GROUP BY`) |

**Analogy:**

Imagine you have a basket of fruits (your table's rows), and you want to prepare fruit salads.

*   **`WHERE`**: You pick out all the *rotten apples* *before* you even start cutting them up for salads. You're filtering individual fruits based on their quality.
*   **`GROUP BY`**: You group the remaining good fruits by type: a pile of apples, a pile of bananas, a pile of oranges. (Each pile is a 'group').
*   **`HAVING`**: Now, from your piles of grouped fruits, you decide to only keep the piles where the *total weight* of the fruit in that pile is more than 1 kg. You're filtering the *piles (groups)* based on an aggregate property (total weight).

In SQL, `WHERE` applies to rows before they are grouped, and `HAVING` applies to groups after aggregation. If you need to filter individual rows before grouping, use `WHERE`. If you need to filter groups based on aggregate results, use `HAVING`.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 6: INNER JOIN

Act as a SQL expert.

Create two related tables, such as:
- employees
- departments

Demonstrate an INNER JOIN to combine data from both tables.
Explain how joins help retrieve related information.

---

## Setting up `employees` and `departments` tables for `INNER JOIN`

To demonstrate `INNER JOIN`, we'll create two related tables: `employees` (which we're already familiar with) and a new `departments` table. The `employees` table will have a `department_id` column that links to the `department_id` in the `departments` table. This creates a relationship between them.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the departments table first (as employees references it)
create_departments_table_sql = """
CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT NOT NULL
);
"""
cursor.execute(create_departments_table_sql)

# Insert some example data into departments
insert_department_data_sql = """
INSERT INTO departments (department_id, department_name) VALUES
(101, 'Sales'),
(102, 'Marketing'),
(103, 'Engineering'),
(104, 'Human Resources'),
(105, 'Finance');
"""
cursor.execute(insert_department_data_sql)

# Create the employees table (with a foreign key to departments)
create_employees_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department_id INTEGER,
    salary REAL,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);
"""
cursor.execute(create_employees_table_sql)

# Insert some example data into employees
insert_employee_data_sql = """
INSERT INTO employees (employee_id, name, department_id, salary) VALUES
(1, 'Alice Smith', 101, 60000.00),
(2, 'Bob Johnson', 102, 75000.00),
(3, 'Charlie Brown', 103, 90000.00),
(4, 'Diana Prince', 101, 62000.00),
(5, 'Eve Davis', 104, 55000.00),
(6, 'Frank White', 103, 95000.00),
(7, 'Grace Lee', 102, 80000.00),
(8, 'Henry King', 101, 70000.00),
(9, 'Ivy Green', 104, 58000.00),
(10, 'Jack Miller', NULL, 72000.00); -- Employee with no department
"""
cursor.execute(insert_employee_data_sql)

# Commit the changes
conn.commit()

print("Tables 'departments' and 'employees' created and data inserted successfully.")

print("\nData in 'departments' table:")
cursor.execute("SELECT * FROM departments;")
for row in cursor.fetchall():
    print(row)

print("\nData in 'employees' table:")
cursor.execute("SELECT * FROM employees;")
for row in cursor.fetchall():
    print(row)

Tables 'departments' and 'employees' created and data inserted successfully.

Data in 'departments' table:
(101, 'Sales')
(102, 'Marketing')
(103, 'Engineering')
(104, 'Human Resources')
(105, 'Finance')

Data in 'employees' table:
(1, 'Alice Smith', 101, 60000.0)
(2, 'Bob Johnson', 102, 75000.0)
(3, 'Charlie Brown', 103, 90000.0)
(4, 'Diana Prince', 101, 62000.0)
(5, 'Eve Davis', 104, 55000.0)
(6, 'Frank White', 103, 95000.0)
(7, 'Grace Lee', 102, 80000.0)
(8, 'Henry King', 101, 70000.0)
(9, 'Ivy Green', 104, 58000.0)
(10, 'Jack Miller', None, 72000.0)

## Understanding `INNER JOIN`

An `INNER JOIN` returns only the rows that have matching values in both tables being joined. It's the most common type of join. Think of it as finding the intersection of two tables based on a common column (or columns).

The basic syntax looks like this:

```sql
SELECT columns
FROM TableA
INNER JOIN TableB ON TableA.common_column = TableB.common_column;
```

Here, `ON` specifies the condition for matching rows between the two tables.

### Example: Combine `employees` and `departments` using `INNER JOIN`

Let's retrieve employee names along with their full department names. We'll join `employees` and `departments` on their shared `department_id`.

In [ ]:
print("\nEmployees with their department names (INNER JOIN):")
cursor.execute("""
SELECT
    e.name,
    d.department_name
FROM
    employees AS e
INNER JOIN
    departments AS d ON e.department_id = d.department_id;
""")
for row in cursor.fetchall():
    print(row)

Employees with their department names (INNER JOIN):
('Alice Smith', 'Sales')
('Bob Johnson', 'Marketing')
('Charlie Brown', 'Engineering')
('Diana Prince', 'Sales')
('Eve Davis', 'Human Resources')
('Frank White', 'Engineering')
('Grace Lee', 'Marketing')
('Henry King', 'Sales')
('Ivy Green', 'Human Resources')

Notice that 'Jack Miller' is not in the results. This is because Jack has a `NULL` `department_id` in the `employees` table, and there's no matching `department_id` for `NULL` in the `departments` table. `INNER JOIN` explicitly requires a match in *both* tables.

## How Joins Help Retrieve Related Information

Joins are absolutely fundamental in relational databases because they allow you to:

*   **Combine Fragmented Data:** Data is often stored across multiple tables to avoid redundancy and maintain data integrity (a concept known as normalization). For instance, storing department names directly in the `employees` table for every employee would be redundant. Joins let you bring these related pieces of information together when you need them.
*   **Answer Complex Questions:** Many real-world queries require information from more than one table. For example, 'Show me all employees who work in the 'Sales' department and earn more than $60,000.' This requires data from both `employees` (salary) and `departments` (department name).
*   **Maintain Data Integrity:** By linking tables with foreign keys, joins enforce relationships and ensure that data remains consistent across your database. If a `department_id` exists in `employees`, it must exist in `departments` (unless explicitly allowed by the foreign key constraint, like `NULL` values).
*   **Improve Query Flexibility:** Instead of denormalizing your database (putting all data in one large table, which can lead to inefficiencies and anomalies), joins provide a flexible way to construct views of your data tailored to specific analytical needs, without altering the underlying storage structure.

In essence, joins are the glue that connects your relational database, enabling you to navigate and extract meaningful, interconnected information from separate but related datasets.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 7: LEFT JOIN

Act as a SQL instructor.

Explain LEFT JOIN with a simple example.
Show how LEFT JOIN returns all records from one table
even if matching records do not exist in the other table.

Explain when LEFT JOIN is useful.

---

## Setting up `employees` and `departments` tables for `LEFT JOIN`

To demonstrate `LEFT JOIN`, we'll re-establish our in-memory SQLite database connection and recreate the `employees` and `departments` tables. We'll use the same data as our `INNER JOIN` example, specifically keeping 'Jack Miller' with a `NULL` `department_id` to highlight the behavior of a `LEFT JOIN`.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the departments table
create_departments_table_sql = """
CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT NOT NULL
);
"""
cursor.execute(create_departments_table_sql)

# Insert some example data into departments
insert_department_data_sql = """
INSERT INTO departments (department_id, department_name) VALUES
(101, 'Sales'),
(102, 'Marketing'),
(103, 'Engineering'),
(104, 'Human Resources'),
(105, 'Finance');
"""
cursor.execute(insert_department_data_sql)

# Create the employees table (with a foreign key to departments)
create_employees_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department_id INTEGER,
    salary REAL,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);
"""
cursor.execute(create_employees_table_sql)

# Insert some example data into employees, including one with a NULL department_id
insert_employee_data_sql = """
INSERT INTO employees (employee_id, name, department_id, salary) VALUES
(1, 'Alice Smith', 101, 60000.00),
(2, 'Bob Johnson', 102, 75000.00),
(3, 'Charlie Brown', 103, 90000.00),
(4, 'Diana Prince', 101, 62000.00),
(5, 'Eve Davis', 104, 55000.00),
(6, 'Frank White', 103, 95000.00),
(7, 'Grace Lee', 102, 80000.00),
(8, 'Henry King', 101, 70000.00),
(9, 'Ivy Green', 104, 58000.00),
(10, 'Jack Miller', NULL, 72000.00); -- Employee with no department
"""
cursor.execute(insert_employee_data_sql)

# Commit the changes
conn.commit()

print("Tables 'departments' and 'employees' created and data inserted successfully.")

print("\nData in 'employees' table (before JOIN):")
cursor.execute("SELECT employee_id, name, department_id FROM employees;")
for row in cursor.fetchall():
    print(row)

print("\nData in 'departments' table (before JOIN):")
cursor.execute("SELECT department_id, department_name FROM departments;")
for row in cursor.fetchall():
    print(row)

Tables 'departments' and 'employees' created and data inserted successfully.

Data in 'employees' table (before JOIN):
(1, 'Alice Smith', 101)
(2, 'Bob Johnson', 102)
(3, 'Charlie Brown', 103)
(4, 'Diana Prince', 101)
(5, 'Eve Davis', 104)
(6, 'Frank White', 103)
(7, 'Grace Lee', 102)
(8, 'Henry King', 101)
(9, 'Ivy Green', 104)
(10, 'Jack Miller', None)

Data in 'departments' table (before JOIN):
(101, 'Sales')
(102, 'Marketing')
(103, 'Engineering')
(104, 'Human Resources')
(105, 'Finance')

## Understanding `LEFT JOIN`

A `LEFT JOIN` (also called `LEFT OUTER JOIN`) returns all records from the *left* table, and the matching records from the *right* table. If there is no match in the right table, `NULL` values are used for columns from the right table. This is incredibly useful when you want to see everything from your primary table and fill in related information where available.

The basic syntax is:

```sql
SELECT columns
FROM LeftTable
LEFT JOIN RightTable ON LeftTable.common_column = RightTable.common_column;
```

### Example: Combine `employees` and `departments` using `LEFT JOIN`

Let's get all employees and their department names. Employees without a matching department will still appear in the result, with `NULL` for their department name.

In [ ]:
print("\nEmployees with their department names (LEFT JOIN - employees as left table):")
cursor.execute("""
SELECT
    e.name,
    d.department_name
FROM
    employees AS e
LEFT JOIN
    departments AS d ON e.department_id = d.department_id;
""")
for row in cursor.fetchall():
    print(row)

Employees with their department names (LEFT JOIN - employees as left table):
('Alice Smith', 'Sales')
('Bob Johnson', 'Marketing')
('Charlie Brown', 'Engineering')
('Diana Prince', 'Sales')
('Eve Davis', 'Human Resources')
('Frank White', 'Engineering')
('Grace Lee', 'Marketing')
('Henry King', 'Sales')
('Ivy Green', 'Human Resources')
('Jack Miller', None)

Notice that 'Jack Miller', who has a `NULL` `department_id` in the `employees` table, is now included in the results. For Jack, the `department_name` column from the `departments` table shows `None` (which represents `NULL` in Python's `sqlite3` output), because there was no matching department.

## When is `LEFT JOIN` useful?

`LEFT JOIN` is invaluable in many real-world scenarios, especially when you need to retain all records from one dataset while enriching them with information from another, even if that information isn't always present. Some common use cases include:

*   **Finding Unmatched Records:** Easily identify records in the left table that do *not* have a corresponding entry in the right table. For example, finding employees who are not assigned to any department, or products that have never been sold.
    ```sql
    SELECT e.name
    FROM employees AS e
    LEFT JOIN departments AS d ON e.department_id = d.department_id
    WHERE d.department_id IS NULL;
    ```
*   **Comprehensive Listings:** When you need a full list of items from a main table, and then want to show any related details. For instance, listing all customers and their last order date (if they have one), or all products and their current stock level (even if zero).
*   **Reporting and Analysis:** Generating reports where you want to show all entities from a primary category and include optional or missing related data. E.g., showing all regions and their sales figures (even if a region had no sales).
*   **Data Validation:** Checking for referential integrity issues, where records in one table might not have valid foreign key references in another.

In essence, `LEFT JOIN` provides a way to gather all primary information and then opportunistically add secondary information, making it a flexible tool for data exploration and reporting.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 8: Handling Duplicate Records

Act as a SQL analyst.

Explain how duplicate records occur in databases.
Demonstrate how to:
- identify duplicates
- remove duplicates using DISTINCT

Explain why handling duplicates is important.

---

## How Duplicate Records Occur in Databases

Duplicate records happen when the same information is stored more than once in a table. This can occur for several reasons:

*   **Data Entry Errors:** Manual input can lead to typos or accidental re-entry of existing data.
*   **System Integration Issues:** When data is imported from multiple sources, different systems might record the same entity slightly differently, or simply re-import existing data.
*   **Lack of Proper Constraints:** If a table doesn't have appropriate primary keys or unique constraints defined on columns that should contain unique values (like `employee_id`), the database system won't prevent duplicates from being inserted.
*   **Application Logic Errors:** Software bugs or design flaws in applications can sometimes cause multiple insertions of the same record.
*   **Data Migration:** During data migration or merging of databases, it's common for duplicate entries to arise if not carefully managed.

Duplicates can lead to inaccurate reports, flawed analysis, and general data inconsistency, making data cleanup a critical task.

## Setting up the `employees` table with Duplicates

To demonstrate how to identify and handle duplicates, let's create a new `employees` table and deliberately insert some identical records.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the employees table
# Note: We're making employee_id NOT PRIMARY KEY here to allow duplicate IDs for demonstration purposes
create_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER,
    name TEXT NOT NULL,
    department TEXT,
    salary REAL
);
"""
cursor.execute(create_table_sql)

# Insert some example data, including intentional duplicates
insert_data_sql = """
INSERT INTO employees (employee_id, name, department, salary) VALUES
(1, 'Alice Smith', 'Sales', 60000.00),
(2, 'Bob Johnson', 'Marketing', 75000.00),
(3, 'Charlie Brown', 'Engineering', 90000.00),
(1, 'Alice Smith', 'Sales', 60000.00), -- Duplicate of Alice
(4, 'Diana Prince', 'Sales', 62000.00),
(2, 'Bob Johnson', 'Marketing', 75000.00), -- Duplicate of Bob
(5, 'Eve Davis', 'HR', 55000.00),
(3, 'Charlie Brown', 'Engineering', 90000.00); -- Duplicate of Charlie
"""
cursor.execute(insert_data_sql)

# Commit the changes
conn.commit()

print("Table 'employees' created and data inserted with duplicates successfully.")

print("\nAll records in 'employees' table (including duplicates):")
cursor.execute("SELECT * FROM employees;")
for row in cursor.fetchall():
    print(row)

Table 'employees' created and data inserted with duplicates successfully.

All records in 'employees' table (including duplicates):
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)
(1, 'Alice Smith', 'Sales', 60000.0)
(4, 'Diana Prince', 'Sales', 62000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(5, 'Eve Davis', 'HR', 55000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)

## Identifying Duplicate Records

To identify duplicates, we often use the `GROUP BY` clause in combination with the `COUNT()` aggregate function. We group by all columns that constitute a 'unique' record and then look for groups where the count is greater than 1.

In [ ]:
print("\nIdentifying duplicate records:")
cursor.execute("""
SELECT employee_id, name, department, salary, COUNT(*)
FROM employees
GROUP BY employee_id, name, department, salary
HAVING COUNT(*) > 1;
""")
for row in cursor.fetchall():
    print(row)
print("\nThis shows us which records appear more than once and how many times they appear.")

Identifying duplicate records:
(1, 'Alice Smith', 'Sales', 60000.0, 2)
(2, 'Bob Johnson', 'Marketing', 75000.0, 2)
(3, 'Charlie Brown', 'Engineering', 90000.0, 2)

This shows us which records appear more than once and how many times they appear.

## Removing Duplicates using `DISTINCT`

The `DISTINCT` keyword is used in a `SELECT` statement to return only unique (different) values. It effectively removes duplicate rows from the result set.

In [ ]:
print("\nRecords from 'employees' table using DISTINCT (showing unique rows only):")
cursor.execute("SELECT DISTINCT employee_id, name, department, salary FROM employees;")
for row in cursor.fetchall():
    print(row)
print("\nNotice how the duplicate entries for Alice, Bob, and Charlie are now gone.")

Records from 'employees' table using DISTINCT (showing unique rows only):
(1, 'Alice Smith', 'Sales', 60000.0)
(2, 'Bob Johnson', 'Marketing', 75000.0)
(3, 'Charlie Brown', 'Engineering', 90000.0)
(4, 'Diana Prince', 'Sales', 62000.0)
(5, 'Eve Davis', 'HR', 55000.0)

Notice how the duplicate entries for Alice, Bob, and Charlie are now gone.

## Why Handling Duplicates is Important

Dealing with duplicate records is crucial for several reasons:

*   **Accuracy of Data:** Duplicates lead to inflated counts, sums, and averages, distorting analytical results and reports. For example, if 'Alice Smith' is counted twice, her salary might be double-counted in total payroll calculations.
*   **Data Integrity:** A clean, de-duplicated database is easier to maintain and ensures the reliability of the information.
*   **Performance:** Large numbers of duplicate records can slow down queries, indexing, and other database operations, impacting overall system performance.
*   **Business Decisions:** Inaccurate data derived from duplicates can lead to poor business decisions, such as over-stocking inventory, misidentifying customer trends, or misallocating resources.
*   **Storage Efficiency:** While often a minor concern for small datasets, duplicates consume unnecessary storage space.

While `DISTINCT` is excellent for retrieving unique rows in a query, *permanently* removing duplicates from a table often involves more complex `DELETE` statements or creating a new table with unique records and replacing the old one. The best long-term solution is to implement proper database design with `PRIMARY KEY` and `UNIQUE` constraints to prevent duplicates from being inserted in the first place.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 9: Subqueries

Act as a SQL expert.

Explain what subqueries are.
Provide a simple example where a subquery is used
inside a SELECT or WHERE clause.

Explain the logic step by step.

---

## Setting up `employees` and `departments` tables for Subqueries

To demonstrate subqueries, we'll re-establish our in-memory SQLite database connection and recreate the `employees` and `departments` tables. This setup is similar to what we used for joins, as subqueries often work with related data.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the departments table
create_departments_table_sql = """
CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT NOT NULL
);
"""
cursor.execute(create_departments_table_sql)

# Insert some example data into departments
insert_department_data_sql = """
INSERT INTO departments (department_id, department_name) VALUES
(101, 'Sales'),
(102, 'Marketing'),
(103, 'Engineering'),
(104, 'Human Resources'),
(105, 'Finance');
"""
cursor.execute(insert_department_data_sql)

# Create the employees table
create_employees_table_sql = """
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department_id INTEGER,
    salary REAL,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);
"""
cursor.execute(create_employees_table_sql)

# Insert some example data into employees
insert_employee_data_sql = """
INSERT INTO employees (employee_id, name, department_id, salary) VALUES
(1, 'Alice Smith', 101, 60000.00),
(2, 'Bob Johnson', 102, 75000.00),
(3, 'Charlie Brown', 103, 90000.00),
(4, 'Diana Prince', 101, 62000.00),
(5, 'Eve Davis', 104, 55000.00),
(6, 'Frank White', 103, 95000.00),
(7, 'Grace Lee', 102, 80000.00),
(8, 'Henry King', 101, 70000.00),
(9, 'Ivy Green', 104, 58000.00),
(10, 'Jack Miller', 101, 72000.00);
"""
cursor.execute(insert_employee_data_sql)

# Commit the changes
conn.commit()

print("Tables 'departments' and 'employees' created and data inserted successfully.")

print("\nData in 'employees' table:")
cursor.execute("SELECT * FROM employees;")
for row in cursor.fetchall():
    print(row)

print("\nData in 'departments' table:")
cursor.execute("SELECT * FROM departments;")
for row in cursor.fetchall():
    print(row)

Tables 'departments' and 'employees' created and data inserted successfully.

Data in 'employees' table:
(1, 'Alice Smith', 101, 60000.0)
(2, 'Bob Johnson', 102, 75000.0)
(3, 'Charlie Brown', 103, 90000.0)
(4, 'Diana Prince', 101, 62000.0)
(5, 'Eve Davis', 104, 55000.0)
(6, 'Frank White', 103, 95000.0)
(7, 'Grace Lee', 102, 80000.0)
(8, 'Henry King', 101, 70000.0)
(9, 'Ivy Green', 104, 58000.0)
(10, 'Jack Miller', 101, 72000.0)

Data in 'departments' table:
(101, 'Sales')
(102, 'Marketing')
(103, 'Engineering')
(104, 'Human Resources')
(105, 'Finance')

## What are Subqueries?

A **subquery** (also known as an inner query or nested query) is a query embedded inside another SQL query. The inner query executes first, and its result is then used by the outer query. Subqueries can be used in various parts of a SQL statement, including the `SELECT` clause, `FROM` clause (as a derived table), `WHERE` clause, and `HAVING` clause. They are often used to retrieve data that will be used to restrict or enhance the data retrieved by the main query.

### Example 1: Subquery in a `WHERE` Clause

Let's find all employees who work in the 'Sales' department, but instead of joining, we'll use a subquery to first find the `department_id` for 'Sales'.

In [ ]:
print("\nEmployees in the 'Sales' department (using a subquery in WHERE):")
cursor.execute("""
SELECT
    name, department_id, salary
FROM
    employees
WHERE
    department_id = (SELECT department_id FROM departments WHERE department_name = 'Sales');
""")
for row in cursor.fetchall():
    print(row)

Employees in the 'Sales' department (using a subquery in WHERE):
('Alice Smith', 101, 60000.0)
('Diana Prince', 101, 62000.0)
('Henry King', 101, 70000.0)
('Jack Miller', 101, 72000.0)

#### Logic Step by Step:

1.  **Inner Query Execution (first):**
    ```sql
    SELECT department_id FROM departments WHERE department_name = 'Sales'
    ```
    This query runs first. It goes to the `departments` table, looks for the row where `department_name` is 'Sales', and retrieves its `department_id`. In our example, this would return `101`.

2.  **Outer Query Execution (second):**
    The result of the inner query (`101`) is then substituted into the outer query:
    ```sql
    SELECT name, department_id, salary
    FROM employees
    WHERE department_id = 101;
    ```
    This outer query then selects the name, department ID, and salary from the `employees` table for all employees whose `department_id` is `101`. This effectively gives us all employees in the 'Sales' department.

### Example 2: Subquery in a `SELECT` Clause

Sometimes you want to include a summary value from another query alongside your main query results. Let's retrieve each employee's name and salary, and also include the overall average salary of all employees as an additional column for each row.

In [ ]:
print("\nEmployees with overall average salary (using a subquery in SELECT):")
cursor.execute("""
SELECT
    name,
    salary,
    (SELECT AVG(salary) FROM employees) AS overall_avg_salary
FROM
    employees;
""")
for row in cursor.fetchall():
    print(row)

Employees with overall average salary (using a subquery in SELECT):
('Alice Smith', 60000.0, 71700.0)
('Bob Johnson', 75000.0, 71700.0)
('Charlie Brown', 90000.0, 71700.0)
('Diana Prince', 62000.0, 71700.0)
('Eve Davis', 55000.0, 71700.0)
('Frank White', 95000.0, 71700.0)
('Grace Lee', 80000.0, 71700.0)
('Henry King', 70000.0, 71700.0)
('Ivy Green', 58000.0, 71700.0)
('Jack Miller', 72000.0, 71700.0)

#### Logic Step by Step:

1.  **Inner Query Execution (first):**
    ```sql
    SELECT AVG(salary) FROM employees
    ```
    This subquery calculates the average salary of *all* employees in the `employees` table. This value is computed once.

2.  **Outer Query Execution (second):**
    The outer query then selects the `name` and `salary` for each employee. For every row processed by the outer query, the pre-calculated `overall_avg_salary` from the inner query is included as a new column. This means the same average salary value will appear for every employee row.

---

In [ ]:
# It's good practice to close the connection when you're done
conn.close()
print("Database connection closed.")

Database connection closed.

# Prompt 10: SQL Concept Summary

Act as a SQL instructor.

Summarize the most important SQL concepts covered:
- SELECT
- WHERE
- GROUP BY
- HAVING
- JOINS
- SUBQUERIES

Explain how these concepts work together in real-world databases.

## Summary of Important SQL Concepts

We've explored several fundamental SQL concepts that form the backbone of database interaction. Heres a concise summary of each:

*   **`SELECT`**: This is the primary command for retrieving data from one or more tables. You specify which columns you want to see (`SELECT column1, column2`) or all columns (`SELECT *`). It's the starting point for almost any data retrieval task.

*   **`WHERE`**: Used in conjunction with `SELECT` (and other clauses), `WHERE` filters individual rows based on specified conditions *before* any grouping or aggregation occurs. It's how you specify criteria to narrow down the dataset you're interested in.

*   **`GROUP BY`**: This clause organizes identical data into groups. It's typically used with aggregate functions (`COUNT`, `SUM`, `AVG`, `MIN`, `MAX`) to perform calculations on each group, rather than on the entire dataset. For example, calculating the average salary *per department*.

*   **`HAVING`**: Similar to `WHERE`, but `HAVING` filters *groups* based on conditions applied to aggregate functions. It's used *after* `GROUP BY` and acts as a filter for the summarized groups, allowing you to select only those groups that meet certain aggregate criteria.

*   **`JOINS`**: These are used to combine rows from two or more tables based on a related column between them. We specifically looked at:
    *   **`INNER JOIN`**: Returns only the rows that have matching values in *both* tables.
    *   **`LEFT JOIN`**: Returns all rows from the *left* table, and the matching rows from the *right* table. If there's no match in the right table, `NULL`s are returned for the right table's columns.
    Joins are crucial for retrieving information stored across normalized tables.

*   **`SUBQUERIES`**: Also known as nested queries or inner queries, a subquery is a query embedded within another SQL query. The inner query executes first, and its result is used by the outer query. They can be used in `SELECT`, `FROM`, `WHERE`, and `HAVING` clauses to build more complex and dynamic queries.

## How These Concepts Work Together in Real-World Databases

In real-world applications, these SQL concepts are rarely used in isolation; they are powerful when combined to answer complex business questions and generate meaningful reports:

1.  **Foundation of Retrieval:** Every interaction typically starts with **`SELECT`** to specify what data you need.

2.  **Precise Filtering:** You then use **`WHERE`** to narrow down the *individual records* to only those relevant to your immediate analysis (e.g., all sales *this month*).

3.  **Cross-Table Context:** If the information you need is spread across multiple tables, you'll use **`JOINS`** (e.g., `INNER JOIN` to see customer names with their orders, `LEFT JOIN` to see all customers, even those without orders).

4.  **Summarization for Insights:** Once you have the relevant, joined data, you often use **`GROUP BY`** with aggregate functions like `SUM`, `AVG`, `COUNT` to summarize information (e.g., total sales *per product category*).

5.  **Filtering Summaries:** To focus on specific summarized data, you apply **`HAVING`** (e.g., product categories where total sales *exceed $10,000*).

6.  **Dynamic Conditions & Complex Logic:** **`SUBQUERIES`** come into play when conditions or values for your main query depend on the result of another query. For instance, finding all employees whose salary is *higher than the average salary of their department* (where the department average itself needs a subquery).

**Example Flow (Conceptual):**

Imagine you want to find the top 5 highest-spending customers last quarter who placed orders for products from a specific 'Electronics' category.

*   You'd **`SELECT`** customer names and total spending.
*   You'd **`INNER JOIN`** `Customers`, `Orders`, and `Products` tables.
*   You'd use **`WHERE`** to filter orders placed 'last quarter' AND for products in the 'Electronics' category.
*   You'd **`GROUP BY`** customer name to sum their total spending.
*   You'd use **`HAVING`** to ensure only customers with a minimum total spending are considered (or maybe even skip this if all are relevant).
*   You'd **`ORDER BY`** total spending in descending order.
*   You'd **`LIMIT`** the results to 5.
*   A **`SUBQUERY`** might be used if, for example, the 'Electronics' category ID needed to be looked up dynamically from a `Categories` table based on its name.

This interconnectedness allows SQL to be an incredibly flexible and powerful language for extracting precise, aggregated, and relevant information from complex relational databases, driving business intelligence and decision-making.